DataProcessors/СозданиеПоступленияРеализацииИзCSV.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>СозданиеПоступленияРеализацииИзCSV</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/ПоступлениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПоступлениеТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РеализацияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>РеализацияТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогСумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Количество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стоимость</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/СозданиеПоступленияРеализацииИзCSV/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СоздатьДокументПоступлениеНаСервере() 
	
	Если Объект.Контрагент.Пустая() 
		ИЛИ Объект.Договор.Пустая() 
		ИЛИ Объект.Склад.Пустая() 
		ИЛИ Объект.Валюта.Пустая()
		ИЛИ ИтогСумма = 0 Тогда
		Сообщить("Документ не может быть создан! Данные не заполнены!");
	Иначе
		НовыйДокумент = Документы.ПоступлениеТоваров.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Поставщик = Объект.Контрагент; 
		НовыйДокумент.Договор   = Объект.Договор; 
		НовыйДокумент.Склад     = Объект.Склад; 
		НовыйДокумент.Валюта    = Объект.Валюта; 
		НовыйДокумент.ВидЦены   = ВидЦены; 
		НовыйДокумент.ИтогСумма = ИтогСумма;  
		
		Для Каждого ТекСтрокаТовары ИЗ  ТаблицаНоменклатуры Цикл
			Строка = НовыйДокумент.Товары.Добавить(); 
			Строка.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Строка.Количество   = ТекСтрокаТовары.Количество;
			Строка.Цена         = ТекСтрокаТовары.Цена;
			Строка.Стоимость    = ТекСтрокаТовары.Стоимость;
		КонецЦикла;
		
		Если СразуПроводитьДокумент Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НовыйДокумент.Записать();
		КонецЕсли;
		
		ТаблицаНоменклатуры.Очистить();
		ИтогСумма = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументРеализацияНаСервере() 
	
	Если Объект.Контрагент.Пустая() 
		ИЛИ Объект.Договор.Пустая() 
		ИЛИ Объект.Склад.Пустая() 
		ИЛИ Объект.Валюта.Пустая()
		ИЛИ ИтогСумма = 0 Тогда
		Сообщить("Документ не может быть создан! Данные не заполнены!");
	Иначе
		НовыйДокумент = Документы.РеализацияТоваров.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДата();
		НовыйДокумент.Покупатель = Объект.Контрагент; 
		НовыйДокумент.Договор   = Объект.Договор; 
		НовыйДокумент.Склад     = Объект.Склад; 
		НовыйДокумент.Валюта    = Объект.Валюта; 
		НовыйДокумент.ВидЦены   = ВидЦены; 
		НовыйДокумент.ИтогСумма = ИтогСумма;  
		
		Для Каждого ТекСтрокаТовары ИЗ  ТаблицаНоменклатуры Цикл
			Строка = НовыйДокумент.Товары.Добавить(); 
			Строка.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Строка.Количество   = ТекСтрокаТовары.Количество;
			Строка.Цена         = ТекСтрокаТовары.Цена;
			Строка.Стоимость    = ТекСтрокаТовары.Стоимость;
		КонецЦикла;
		
		Если СразуПроводитьДокумент Тогда
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НовыйДокумент.Записать();
		КонецЕсли;
		
		ТаблицаНоменклатуры.Очистить();;
		ИтогСумма = 0;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокумент(Команда) 
	
	Если ПоступлениеТоваров = Истина Тогда
		СоздатьДокументПоступлениеНаСервере();
	ИначеЕсли 	
		РеализацияТоваров = Истина Тогда
		СоздатьДокументРеализацияНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ТаблицаНоменклатуры.Очистить();
	
	//Получить текстовый документ
	Документ = Новый ТекстовыйДокумент;
	Документ.Прочитать(Объект.ПутьКФайлу); 
	
	//Построчный обход текстового документа со второй строки (исключая шапку) по последнюю строку документа
	Для НомерСтроки = 2 По Документ.КоличествоСтрок() Цикл
		
		//Получить строку документа
		СтрокаДокумента = Документ.ПолучитьСтроку(НомерСтроки);
		
		//Разложим каждое значение разделенное ; в массив (разделим строку на элементы)
		МассивЗначенийСтроки = СтрРазделить(СтрокаДокумента, ";");
		
		//Получить значения массива
		Номенклатура  = МассивЗначенийСтроки [0];
		Количество    = МассивЗначенийСтроки [1];
		Цена          = МассивЗначенийСтроки [2];
		Стоимость     = МассивЗначенийСтроки [3];
		
		//Проверяем есть ли такая номенклатура в справочнике    Если склад есть, возвнащается ссылка иначе Не заполнено
		СсылкаНаНоменклатуру = Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура);  
		
		//если номенклатура есть - Добавляем в таблицу, иначе выводим сообщение и пропускаем
		Если ЗначениеЗаполнено(СсылкаНаНоменклатуру) Тогда 
			
			Строка = ТаблицаНоменклатуры.Добавить(); 
			Строка.Номенклатура = СсылкаНаНоменклатуру;
			Строка.Количество   = Количество;
			Строка.Цена         = Цена;
			Строка.Стоимость    = Стоимость;
		Иначе 
			Сообщить ("Номенклатура - " + Номенклатура + ", строка CSV файла - " + (НомерСтроки - 1) + ", отсутствует в справочнике!");
			Продолжить; //Возвращаем выполнение кода в начало цикла. (переходим к следующей строке)
		КонецЕсли;
	КонецЦикла; 
	
	ИтогСумма = ТаблицаНоменклатуры.Итог("Стоимость");
	ВидЦены   = Справочники.ВидыЦен.ИзЗагрузки;

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим); 
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = НСтр("ru = 'Выберите CSV файл'")
	+ "(*.csv)|*.csv";
	ДиалогОткрытияФайла.Фильтр = Фильтр; 
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите CSV файл";
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогОткрытияФайла.ПолноеИмяФайла;	
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоступлениеТоваров = Истина;
	РеализацияТоваров = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеТоваровПриИзменении(Элемент)  
	Если ПоступлениеТоваров = Истина Тогда
		РеализацияТоваров = Ложь;
	Иначе	
		РеализацияТоваров = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РеализацияТоваровПриИзменении(Элемент) 
	Если РеализацияТоваров = Истина Тогда
		ПоступлениеТоваров = Ложь;
	Иначе	
		ПоступлениеТоваров = Истина;
	КонецЕсли;
КонецПроцедуры
